#include <iostream>

int main()
/* 11.  ƒл€ натурального числа   напечатать фразу "мы нашли   грибов в лесу", 
согласовав окончание слова "гриб" с числом  .*/
{
	setlocale(LC_ALL, "Russian");
	std::cout << " ¬ведите число грибов\n";
	int k;
	std::cin >> k;
	int n = k;
	while (n > 100) {
		n=n%100;
	}
	
	if (n  >= 5 && n <= 20) std::cout << "мы нашли " << k << " грибов в лесу"; // от 5 до 20
	else
		if (n % 10 == 1) std::cout << "мы нашли " << k << " гриб в лесу"; //
		else
			if (n % 10 >= 2 && n % 10 <= 4) std::cout << "мы нашли " << k << " гриба в лесу"; //
			else
				if (n % 10 >= 5 && n % 10 <= 9 || n % 10 == 0) std::cout << "мы нашли " << k << " грибов в лесу"; //
	return 0;
}

